In [1]:
import pandas as pd 
  
# Creating the DataFrame 
df = pd.DataFrame({'Date':['10/2/2011', '11/2/2011', '12/2/2011', '13/2/2011'], 
                    'Event':['Music', 'Poetry', 'Theatre', 'Comedy'], 
                    'Cost':[10000, 5000, 15000, 2000]}) 
  
# Print the dataframe 
print(df)

        Date    Event   Cost
0  10/2/2011    Music  10000
1  11/2/2011   Poetry   5000
2  12/2/2011  Theatre  15000
3  13/2/2011   Comedy   2000

In [6]:
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

In [27]:
df['Discounted_Price'] = df.apply(lambda row: row.Cost - 
                                  (row.Cost * 0.1), axis = 1)
df

        Date    Event   Cost  Discounted_Price
0  10/2/2011    Music  10000            9000.0
1  11/2/2011   Poetry   5000            4500.0
2  12/2/2011  Theatre  15000           13500.0
3  13/2/2011   Comedy   2000            1800.0

In [26]:
for i,j in df.iterrows(): #iterrows return format (<index value of row >, Series(each row values))
    print("{}----{}--type of i{}, type of j {}".format(i,j,type(i),type(j)))

0----Date                10/2/2011
Event                   Music
Cost                    10000
Discounted_Price         9000
Name: 0, dtype: object--type of i<class 'int'>, type of j <class 'pandas.core.series.Series'>
1----Date                11/2/2011
Event                  Poetry
Cost                     5000
Discounted_Price         4500
Name: 1, dtype: object--type of i<class 'int'>, type of j <class 'pandas.core.series.Series'>
2----Date                12/2/2011
Event                 Theatre
Cost                    15000
Discounted_Price        13500
Name: 2, dtype: object--type of i<class 'int'>, type of j <class 'pandas.core.series.Series'>
3----Date                13/2/2011
Event                  Comedy
Cost                     2000
Discounted_Price         1800
Name: 3, dtype: object--type of i<class 'int'>, type of j <class 'pandas.core.series.Series'>

In [28]:
for i,j in df.iteritems(): #iterrows return format (<column name>, Series(each column values))
    print("{}----{}--type of i{}, type of j {}".format(i,j,type(i),type(j)))

Date----0    10/2/2011
1    11/2/2011
2    12/2/2011
3    13/2/2011
Name: Date, dtype: object--type of i<class 'str'>, type of j <class 'pandas.core.series.Series'>
Event----0      Music
1     Poetry
2    Theatre
3     Comedy
Name: Event, dtype: object--type of i<class 'str'>, type of j <class 'pandas.core.series.Series'>
Cost----0    10000
1     5000
2    15000
3     2000
Name: Cost, dtype: int64--type of i<class 'str'>, type of j <class 'pandas.core.series.Series'>
Discounted_Price----0     9000.0
1     4500.0
2    13500.0
3     1800.0
Name: Discounted_Price, dtype: float64--type of i<class 'str'>, type of j <class 'pandas.core.series.Series'>

In [30]:
for i in df.itertuples(): # return format (tuple of index of eac row and each row value)
    print("{}--type of i{}".format(i,type(i)))

Pandas(Index=0, Date='10/2/2011', Event='Music', Cost=10000, Discounted_Price=9000.0)--type of i<class 'pandas.core.frame.Pandas'>
Pandas(Index=1, Date='11/2/2011', Event='Poetry', Cost=5000, Discounted_Price=4500.0)--type of i<class 'pandas.core.frame.Pandas'>
Pandas(Index=2, Date='12/2/2011', Event='Theatre', Cost=15000, Discounted_Price=13500.0)--type of i<class 'pandas.core.frame.Pandas'>
Pandas(Index=3, Date='13/2/2011', Event='Comedy', Cost=2000, Discounted_Price=1800.0)--type of i<class 'pandas.core.frame.Pandas'>